ejercicios_plantuml_relaciones_uml/17_caso_tienda.puml
@startuml
title Ejercicio 17 - Sistema de Tienda
class Cliente
class Pedido
class LineaPedido
class Producto
class Impresora

Cliente "1" -- "0..*" Pedido : realiza
Pedido "1" *-- "1..*" LineaPedido : contiene
LineaPedido "0..*" -- "1" Producto : referencia
Pedido ..> Impresora : <<use>>
@enduml
